---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalResistance
source: html/fe7e2476-58cb-7710-f06a-aa81f9cfc6c2.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalResistance Property

The thermal resistance (R-value) of the material.

## Syntax (C#)
```csharp
public double ThermalResistance { get; }
```